In [92]:
import os
os.getcwd()

'C:\\Users\\ialks\\Documents\\02-04-2025'

In [12]:
import pandas as pd
import numpy as np

In [14]:
data = pd.read_csv('StockData.csv')

In [16]:
data.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [18]:
data.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [20]:
data.isnull().sum()

stock    0
date     0
price    0
dtype: int64

In [24]:
data.dtypes

stock     object
date      object
price    float64
dtype: object

In [26]:
data.duplicated().sum()

0

In [28]:
data.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

In [30]:
data.shape

(5036, 3)

In [32]:
data['price'].min()

28.4

In [36]:
data[data['price']==data['price'].min()]

     stock        date  price
4072   ZTS  11-04-2014   28.4

In [48]:
data[data['price']==data['price'].max()]


#data['price'].max()

#Finds the maximum value in the 'price' column.

#data['price'] == data['price'].max()

#Creates a Boolean mask (True/False) where True indicates rows where 'price' equals the maximum value.

#data[...]

#Filters the data DataFrame, returning only rows where the condition is True.

     stock        date   price
1244  AAPL  18-01-2018  179.26

In [50]:
data['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)

In [52]:
data['stock'].nunique()

4

In [60]:
data['stock'].value_counts()

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

In [62]:
data['stock'].value_counts(normalize = True)

stock
AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: proportion, dtype: float64

In [64]:
new_data = pd.read_excel('new.xlsx')

In [68]:
new_data.head()
# The new_data.head() function in Python (specifically when using Pandas) is used to display the first few rows of a DataFrame. By default, it shows the first 5 rows, but you can specify a different number as an argument.

  stock                 date    price
0  AAPL  2013-08-02 00:00:00  67.8542
1  AAPL  2013-11-02 00:00:00      NaN
2  AAPL  2013-12-02 00:00:00      NaN
3  AAPL           13-02-2013      NaN
4  AAPL           14-02-2013  66.6556

In [74]:
round(data['price'].mean(), 3)
# The Python code snippet round(data['price'].mean(), 3) calculates the mean (average) of the values in the price column of the data DataFrame and then rounds the result to three decimal places. Here's a breakdown of its function:

# data['price']: Accesses the price column from the DataFrame data.

#.mean(): Computes the average value of all entries in the price column.

# round(..., 3): Rounds the computed average to three decimal places for precision or formatting purposes.

73.057

In [78]:
data['price'].median()

69.08500000000001

In [80]:
data['price'].mode()

0    74.59
Name: price, dtype: float64

In [84]:
data.groupby(['stock'])['price'].mean()


#1. **`data.groupby(['stock'])`**: Groups the DataFrame `data` by the values in the `'stock'` column.
#2. **`['price']`**: Selects the `'price'` column from the grouped data.
#3. **`.mean()`**: Calculates the mean of the `'price'` column for each stock group.

stock
AAPL    109.066698
SNI      71.319206
TJX      66.743566
ZTS      45.098648
Name: price, dtype: float64

In [90]:
data.sort_values(by = 'price', ascending = False)

     stock        date   price
1244  AAPL  18-01-2018  179.26
1243  AAPL  17-01-2018  179.10
1245  AAPL  19-01-2018  178.46
1241  AAPL  12-01-2018  177.09
1247  AAPL  23-01-2018  177.04
...    ...         ...     ...
4076   ZTS  17-04-2014   28.60
4074   ZTS  15-04-2014   28.55
4075   ZTS  16-04-2014   28.53
4073   ZTS  14-04-2014   28.48
4072   ZTS  11-04-2014   28.40

[5036 rows x 3 columns]